mobizt/ESP-Mail-Client/src/wcs/esp8266/ESP8266_BearSSLHelpers.cpp
/*
   Copy of BearSSLHelpers.cpp

  WiFiClientBearSSL- SSL client/server for esp8266 using BearSSL libraries
  - Mostly compatible with Arduino WiFi shield library and standard
    WiFiClient/ServerSecure (except for certificate handling).

  Copyright (c) 2018 Earle F. Philhower, III

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/
#ifndef ESP8266_BearSSLHelpers_CPP
#define ESP8266_BearSSLHelpers_CPP

#ifdef ESP8266

#include "ESP8266_BearSSLHelpers.h"
#include <memory>
#include <vector>
#include <bearssl/bearssl.h>
#include <pgmspace.h>
#include <stdlib.h>
#include <string.h>
#include <Arduino.h>
#include <StackThunk.h>
#include <Updater_Signing.h>
#ifndef ARDUINO_SIGNING
#define ARDUINO_SIGNING 0
#endif

namespace esp8266_br_ssl
{
  // Code here is pulled from brssl sources, with the copyright and license
  // shown below.  I've rewritten things using C++ semantics and removed
  // custom VEC_* calls (std::vector to the rescue) and adjusted things to
  // allow for long-running operation (i.e. some memory issues when DERs
  // passed into the decoders).  Bugs are most likely my fault.

  // Original (c) message follows:
  /*
     Copyright (c) 2016 Thomas Pornin <pornin@bolet.org>

     Permission is hereby granted, free of charge, to any person obtaining
     a copy of this software and associated documentation files (the
     "Software"), to deal in the Software without restriction, including
     without limitation the rights to use, copy, modify, merge, publish,
     distribute, sublicense, and/or sell copies of the Software, and to
     permit persons to whom the Software is furnished to do so, subject to
     the following conditions:

     The above copyright notice and this permission notice shall be
     included in all copies or substantial portions of the Software.

     THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
     EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
     MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
     NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
     BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
     ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
     CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
     SOFTWARE.
  */

  class private_key
  {
  public:
    int key_type; /* BR_KEYTYPE_RSA or BR_KEYTYPE_EC */
    union
    {
      br_rsa_private_key rsa;
      br_ec_private_key ec;
    } key;
  };

  class public_key
  {
  public:
    int key_type; /* BR_KEYTYPE_RSA or BR_KEYTYPE_EC */
    union
    {
      br_rsa_public_key rsa;
      br_ec_public_key ec;
    } key;
  };

  class pem_object
  {
  public:
    char *name;
    unsigned char *data;
    size_t data_len;
  };

  // Forward definitions
  void free_ta_contents(br_x509_trust_anchor *ta);
  void free_public_key(public_key *pk);
  void free_private_key(private_key *sk);
  bool looks_like_DER(const unsigned char *buf, size_t len);
  pem_object *decode_pem(const void *src, size_t len, size_t *num);
  void free_pem_object_contents(pem_object *po);

  // Used as callback multiple places to append a string to a vector
  static void byte_vector_append(void *ctx, const void *buff, size_t len)
  {
    std::vector<uint8_t> *vec = static_cast<std::vector<uint8_t> *>(ctx);
    vec->reserve(vec->size() + len); // Allocate extra space all at once
    for (size_t i = 0; i < len; i++)
    {
      vec->push_back(((uint8_t *)buff)[i]);
    }
  }

  static bool certificate_to_trust_anchor_inner(br_x509_trust_anchor *ta, const br_x509_certificate *xc)
  {
    std::unique_ptr<br_x509_decoder_context> dc(new br_x509_decoder_context); // auto-delete on exit
    std::vector<uint8_t> vdn;
    br_x509_pkey *pk;

    // Clear everything in the Trust Anchor
    memset(ta, 0, sizeof(*ta));

    br_x509_decoder_init(dc.get(), byte_vector_append, (void *)&vdn, 0, 0);
    br_x509_decoder_push(dc.get(), xc->data, xc->data_len);
    pk = br_x509_decoder_get_pkey(dc.get());
    if (pk == nullptr)
    {
      return false; // No key present, something broken in the cert!
    }

    // Copy the raw certificate data
    ta->dn.data = (uint8_t *)malloc(vdn.size());
    if (!ta->dn.data)
    {
      return false; // OOM, but nothing yet allocated
    }
    memcpy(ta->dn.data, &vdn[0], vdn.size());
    ta->dn.len = vdn.size();
    ta->flags = 0;
    if (br_x509_decoder_isCA(dc.get()))
    {
      ta->flags |= BR_X509_TA_CA;
    }

    // Extract the public key
    switch (pk->key_type)
    {
    case BR_KEYTYPE_RSA:
      ta->pkey.key_type = BR_KEYTYPE_RSA;
      ta->pkey.key.rsa.n = (uint8_t *)malloc(pk->key.rsa.nlen);
      ta->pkey.key.rsa.e = (uint8_t *)malloc(pk->key.rsa.elen);
      if ((ta->pkey.key.rsa.n == nullptr) || (ta->pkey.key.rsa.e == nullptr))
      {
        free_ta_contents(ta); // OOM, so clean up
        return false;
      }
      memcpy(ta->pkey.key.rsa.n, pk->key.rsa.n, pk->key.rsa.nlen);
      ta->pkey.key.rsa.nlen = pk->key.rsa.nlen;
      memcpy(ta->pkey.key.rsa.e, pk->key.rsa.e, pk->key.rsa.elen);
      ta->pkey.key.rsa.elen = pk->key.rsa.elen;
      return true;
    case BR_KEYTYPE_EC:
      ta->pkey.key_type = BR_KEYTYPE_EC;
      ta->pkey.key.ec.curve = pk->key.ec.curve;
      ta->pkey.key.ec.q = (uint8_t *)malloc(pk->key.ec.qlen);
      if (ta->pkey.key.ec.q == nullptr)
      {
        free_ta_contents(ta); // OOM, so clean up
        return false;
      }
      memcpy(ta->pkey.key.ec.q, pk->key.ec.q, pk->key.ec.qlen);
      ta->pkey.key.ec.qlen = pk->key.ec.qlen;
      return true;
    default:
      free_ta_contents(ta); // Unknown key type
      return false;
    }

