mobizt/ESP-Mail-Client/src/wcs/esp8266/ESP8266_BearSSLHelpers.cpp
    // Should never get here, if so there was an unknown error
    return false;
  }

  br_x509_trust_anchor *certificate_to_trust_anchor(const br_x509_certificate *xc)
  {
    br_x509_trust_anchor *ta = (br_x509_trust_anchor *)malloc(sizeof(br_x509_trust_anchor));
    if (!ta)
    {
      return nullptr;
    }

    if (!certificate_to_trust_anchor_inner(ta, xc))
    {
      free(ta);
      return nullptr;
    }
    return ta;
  }

  void free_ta_contents(br_x509_trust_anchor *ta)
  {
    if (ta)
    {
      free(ta->dn.data);
      if (ta->pkey.key_type == BR_KEYTYPE_RSA)
      {
        free(ta->pkey.key.rsa.n);
        free(ta->pkey.key.rsa.e);
      }
      else if (ta->pkey.key_type == BR_KEYTYPE_EC)
      {
        free(ta->pkey.key.ec.q);
      }
      memset(ta, 0, sizeof(*ta));
    }
  }

  // Checks if a bitstream looks like a valid DER(binary) encoding.
  // Basically tries to verify the length of all included segments
  // matches the length of the input buffer.  Does not actually
  // validate any contents.
  bool looks_like_DER(const unsigned char *buff, size_t len)
  {
    if (len < 2)
    {
      return false;
    }
    if (pgm_read_byte(buff++) != 0x30)
    {
      return false;
    }
    int fb = pgm_read_byte(buff++);
    len -= 2;
    if (fb < 0x80)
    {
      return (size_t)fb == len;
    }
    else if (fb == 0x80)
    {
      return false;
    }
    else
    {
      fb -= 0x80;
      if (len < (size_t)fb + 2)
      {
        return false;
      }
      len -= (size_t)fb;
      size_t dlen = 0;
      while (fb-- > 0)
      {
        if (dlen > (len >> 8))
        {
          return false;
        }
        dlen = (dlen << 8) + (size_t)pgm_read_byte(buff++);
      }
      return dlen == len;
    }
  }

  void free_pem_object_contents(pem_object *po)
  {
    if (po)
    {
      free(po->name);
      free(po->data);
      po->name = nullptr;
      po->data = nullptr;
    }
  }

  // Converts a PEM (~=base64) source into a set of DER-encoded binary blobs.
  // Each blob is named by the ---- BEGIN xxx ---- field, and multiple
  // blobs may be returned.
  pem_object *decode_pem(const void *src, size_t len, size_t *num)
  {
    std::vector<pem_object> pem_list;
    std::unique_ptr<br_pem_decoder_context> pc(new br_pem_decoder_context); // auto-delete on exit
    if (!pc.get())
    {
      return nullptr;
    }
    pem_object po, *pos;
    const unsigned char *buff;
    std::vector<uint8_t> bv;

    *num = 0;
    br_pem_decoder_init(pc.get());
    buff = (const unsigned char *)src;
    po.name = nullptr;
    po.data = nullptr;
    po.data_len = 0;
    bool inobj = false;
    bool extra_nl = true;

    while (len > 0)
    {
      size_t tlen;

      tlen = br_pem_decoder_push(pc.get(), buff, len);
      buff += tlen;
      len -= tlen;
      switch (br_pem_decoder_event(pc.get()))
      {
      case BR_PEM_BEGIN_OBJ:
        po.name = strdup(br_pem_decoder_name(pc.get()));
        br_pem_decoder_setdest(pc.get(), byte_vector_append, &bv);
        inobj = true;
        break;

      case BR_PEM_END_OBJ:
        if (inobj)
        {
          // Stick data into the vector
          po.data = (uint8_t *)malloc(bv.size());
          if (po.data)
          {
            memcpy(po.data, &bv[0], bv.size());
            po.data_len = bv.size();
            pem_list.push_back(po);
          }
          // Clean up state for next blob processing
          bv.clear();
          po.name = nullptr;
          po.data = nullptr;
          po.data_len = 0;
          inobj = false;
        }
        break;

      case BR_PEM_ERROR:
        free(po.name);
        for (size_t i = 0; i < pem_list.size(); i++)
        {
          free_pem_object_contents(&pem_list[i]);
        }
        return nullptr;

      default:
        // Do nothing here, the parser is still working on things
        break;
      }

      if (len == 0 && extra_nl)
      {
        extra_nl = false;
        buff = (const unsigned char *)"\n";
        len = 1;
      }
    }

    if (inobj)
    {
      free(po.name);
      for (size_t i = 0; i < pem_list.size(); i++)
      {
        free_pem_object_contents(&pem_list[i]);
      }
      return nullptr;
    }

    pos = (pem_object *)malloc((1 + pem_list.size()) * sizeof(*pos));
    if (pos)
    {
      *num = pem_list.size();
      pem_list.push_back(po); // Null-terminate list
      memcpy(pos, &pem_list[0], pem_list.size() * sizeof(*pos));
    }
    return pos;
  }

  // Parse out DER or PEM encoded certificates from a binary buffer,
  // potentially stored in PROGMEM.
  br_x509_certificate *read_certificates(const char *buff, size_t len, size_t *num)
  {
    std::vector<br_x509_certificate> cert_list;
    pem_object *pos;
    size_t u, num_pos;
    br_x509_certificate *xcs;
    br_x509_certificate dummy;

    *num = 0;

    if (looks_like_DER((const unsigned char *)buff, len))
    {
      xcs = (br_x509_certificate *)malloc(2 * sizeof(*xcs));
      if (!xcs)
      {
        return nullptr;
      }
      xcs[0].data = (uint8_t *)malloc(len);
      if (!xcs[0].data)
      {
        free(xcs);
        return nullptr;
      }
      memcpy_P(xcs[0].data, buff, len);
      xcs[0].data_len = len;
      xcs[1].data = nullptr;
      xcs[1].data_len = 0;
      *num = 1;
      return xcs;
    }

    pos = decode_pem(buff, len, &num_pos);
    if (!pos)
    {
      return nullptr;
    }
    for (u = 0; u < num_pos; u++)
    {
      if (!strcmp_P(pos[u].name, PSTR("CERTIFICATE")) || !strcmp_P(pos[u].name, PSTR("X509 CERTIFICATE")))
      {
        br_x509_certificate xc;
        xc.data = pos[u].data;
        xc.data_len = pos[u].data_len;
        pos[u].data = nullptr; // Don't free the data we moved to the xc vector!
        cert_list.push_back(xc);
      }
    }
    for (u = 0; u < num_pos; u++)
    {
      free_pem_object_contents(&pos[u]);
    }
    free(pos);

    if (cert_list.size() == 0)
    {
      return nullptr;
    }
    *num = cert_list.size();
    dummy.data = nullptr;
    dummy.data_len = 0;
    cert_list.push_back(dummy);
    xcs = (br_x509_certificate *)malloc(cert_list.size() * sizeof(*xcs));
    if (!xcs)
    {
      for (size_t i = 0; i < cert_list.size(); i++)
      {
        free(cert_list[i].data); // Clean up any captured data blobs
      }
      return nullptr;
    }
    memcpy(xcs, &cert_list[0], cert_list.size() * sizeof(br_x509_certificate));
    // XCS now has [].data pointing to the previously allocated blobs, so don't
    // want to free anything in cert_list[].
    return xcs;
  }

