mobizt/ESP-Mail-Client/src/wcs/esp8266/ESP8266_BearSSLHelpers.cpp
  void free_certificates(br_x509_certificate *certs, size_t num)
  {
    if (certs)
    {
      for (size_t u = 0; u < num; u++)
      {
        free(certs[u].data);
      }
      free(certs);
    }
  }

  static public_key *decode_public_key(const unsigned char *buff, size_t len)
  {
    std::unique_ptr<br_pkey_decoder_context> dc(new br_pkey_decoder_context); // auto-delete on exit
    if (!dc.get())
    {
      return nullptr;
    }

    public_key *pk = nullptr;

    br_pkey_decoder_init(dc.get());
    br_pkey_decoder_push(dc.get(), buff, len);
    int err = br_pkey_decoder_last_error(dc.get());
    if (err != 0)
    {
      return nullptr;
    }

    const br_rsa_public_key *rk = nullptr;
    const br_ec_public_key *ek = nullptr;
    switch (br_pkey_decoder_key_type(dc.get()))
    {
    case BR_KEYTYPE_RSA:
      rk = br_pkey_decoder_get_rsa(dc.get());
      pk = (public_key *)malloc(sizeof *pk);
      if (!pk)
      {
        return nullptr;
      }
      pk->key_type = BR_KEYTYPE_RSA;
      pk->key.rsa.n = (uint8_t *)malloc(rk->nlen);
      pk->key.rsa.e = (uint8_t *)malloc(rk->elen);
      if (!pk->key.rsa.n || !pk->key.rsa.e)
      {
        free(pk->key.rsa.n);
        free(pk->key.rsa.e);
        free(pk);
        return nullptr;
      }
      memcpy(pk->key.rsa.n, rk->n, rk->nlen);
      pk->key.rsa.nlen = rk->nlen;
      memcpy(pk->key.rsa.e, rk->e, rk->elen);
      pk->key.rsa.elen = rk->elen;
      return pk;

    case BR_KEYTYPE_EC:
      ek = br_pkey_decoder_get_ec(dc.get());
      pk = (public_key *)malloc(sizeof *pk);
      if (!pk)
      {
        return nullptr;
      }
      pk->key_type = BR_KEYTYPE_EC;
      pk->key.ec.q = (uint8_t *)malloc(ek->qlen);
      if (!pk->key.ec.q)
      {
        free(pk);
        return nullptr;
      }
      memcpy(pk->key.ec.q, ek->q, ek->qlen);
      pk->key.ec.qlen = ek->qlen;
      return pk;

    default:
      return nullptr;
    }
  }

  void free_public_key(public_key *pk)
  {
    if (pk)
    {
      if (pk->key_type == BR_KEYTYPE_RSA)
      {
        free(pk->key.rsa.n);
        free(pk->key.rsa.e);
      }
      else if (pk->key_type == BR_KEYTYPE_EC)
      {
        free(pk->key.ec.q);
      }
      free(pk);
    }
  }

  static private_key *decode_private_key(const unsigned char *buff, size_t len)
  {
    std::unique_ptr<br_skey_decoder_context> dc(new br_skey_decoder_context); // auto-delete on exit
    if (!dc.get())
    {
      return nullptr;
    }

    private_key *sk = nullptr;

    br_skey_decoder_init(dc.get());
    br_skey_decoder_push(dc.get(), buff, len);
    int err = br_skey_decoder_last_error(dc.get());
    if (err != 0)
    {
      return nullptr;
    }

    const br_rsa_private_key *rk = nullptr;
    const br_ec_private_key *ek = nullptr;
    switch (br_skey_decoder_key_type(dc.get()))
    {
    case BR_KEYTYPE_RSA:
      rk = br_skey_decoder_get_rsa(dc.get());
      sk = (private_key *)malloc(sizeof *sk);
      if (!sk)
      {
        return nullptr;
      }
      sk->key_type = BR_KEYTYPE_RSA;
      sk->key.rsa.p = (uint8_t *)malloc(rk->plen);
      sk->key.rsa.q = (uint8_t *)malloc(rk->qlen);
      sk->key.rsa.dp = (uint8_t *)malloc(rk->dplen);
      sk->key.rsa.dq = (uint8_t *)malloc(rk->dqlen);
      sk->key.rsa.iq = (uint8_t *)malloc(rk->iqlen);
      if (!sk->key.rsa.p || !sk->key.rsa.q || !sk->key.rsa.dp || !sk->key.rsa.dq || !sk->key.rsa.iq)
      {
        free_private_key(sk);
        return nullptr;
      }
      sk->key.rsa.n_bitlen = rk->n_bitlen;
      memcpy(sk->key.rsa.p, rk->p, rk->plen);
      sk->key.rsa.plen = rk->plen;
      memcpy(sk->key.rsa.q, rk->q, rk->qlen);
      sk->key.rsa.qlen = rk->qlen;
      memcpy(sk->key.rsa.dp, rk->dp, rk->dplen);
      sk->key.rsa.dplen = rk->dplen;
      memcpy(sk->key.rsa.dq, rk->dq, rk->dqlen);
      sk->key.rsa.dqlen = rk->dqlen;
      memcpy(sk->key.rsa.iq, rk->iq, rk->iqlen);
      sk->key.rsa.iqlen = rk->iqlen;
      return sk;

    case BR_KEYTYPE_EC:
      ek = br_skey_decoder_get_ec(dc.get());
      sk = (private_key *)malloc(sizeof *sk);
      sk->key_type = BR_KEYTYPE_EC;
      sk->key.ec.curve = ek->curve;
      sk->key.ec.x = (uint8_t *)malloc(ek->xlen);
      if (!sk->key.ec.x)
      {
        free_private_key(sk);
        return nullptr;
      }
      memcpy(sk->key.ec.x, ek->x, ek->xlen);
      sk->key.ec.xlen = ek->xlen;
      return sk;

    default:
      return nullptr;
    }
  }

  void free_private_key(private_key *sk)
  {
    if (sk)
    {
      switch (sk->key_type)
      {
      case BR_KEYTYPE_RSA:
        free(sk->key.rsa.p);
        free(sk->key.rsa.q);
        free(sk->key.rsa.dp);
        free(sk->key.rsa.dq);
        free(sk->key.rsa.iq);
        break;
      case BR_KEYTYPE_EC:
        free(sk->key.ec.x);
        break;
      default:
        // Could be an uninitted key, no sub elements to free
        break;
      }
      free(sk);
    }
  }

  void free_pem_object(pem_object *pos)
  {
    if (pos != nullptr)
    {
      for (size_t u = 0; pos[u].name; u++)
      {
        free_pem_object_contents(&pos[u]);
      }
      free(pos);
    }
  }

  private_key *read_private_key(const char *buff, size_t len)
  {
    private_key *sk = nullptr;
    pem_object *pos = nullptr;

    if (looks_like_DER((const unsigned char *)buff, len))
    {
      sk = decode_private_key((const unsigned char *)buff, len);
      return sk;
    }

    size_t num;
    pos = decode_pem(buff, len, &num);
    if (pos == nullptr)
    {
      return nullptr; // PEM decode error
    }
    for (size_t u = 0; pos[u].name; u++)
    {
      const char *name = pos[u].name;
      if (!strcmp_P(name, PSTR("RSA PRIVATE KEY")) || !strcmp_P(name, PSTR("EC PRIVATE KEY")) || !strcmp_P(name, PSTR("PRIVATE KEY")))
      {
        sk = decode_private_key(pos[u].data, pos[u].data_len);
        free_pem_object(pos);
        return sk;
      }
    }
    // If we hit here, no match
    free_pem_object(pos);
    return nullptr;
  }

  public_key *read_public_key(const char *buff, size_t len)
  {
    public_key *pk = nullptr;
    pem_object *pos = nullptr;

    if (looks_like_DER((const unsigned char *)buff, len))
    {
      pk = decode_public_key((const unsigned char *)buff, len);
      return pk;
    }
    size_t num;
    pos = decode_pem(buff, len, &num);
    if (pos == nullptr)
    {
      return nullptr; // PEM decode error
    }
    for (size_t u = 0; pos[u].name; u++)
    {
      const char *name = pos[u].name;
      if (!strcmp_P(name, PSTR("RSA PUBLIC KEY")) || !strcmp_P(name, PSTR("EC PUBLIC KEY")) || !strcmp_P(name, PSTR("PUBLIC KEY")))
      {
        pk = decode_public_key(pos[u].data, pos[u].data_len);
        free_pem_object(pos);
        return pk;
      }
    }

    // We hit here == no key found
    free_pem_object(pos);
    return pk;
  }

