mobizt/ESP-Mail-Client/src/wcs/esp8266/ESP8266_BearSSLHelpers.cpp
}; // namespace esp8266_br_ssl

namespace ESP8266_TCP
{

  // ----- Public Key -----

  PublicKey::PublicKey()
  {
    _key = nullptr;
  }

  PublicKey::PublicKey(const char *pemKey)
  {
    _key = nullptr;
    parse(pemKey);
  }

  PublicKey::PublicKey(const uint8_t *derKey, size_t derLen)
  {
    _key = nullptr;
    parse(derKey, derLen);
  }

  PublicKey::~PublicKey()
  {
    if (_key)
    {
      esp8266_br_ssl::free_public_key(_key);
    }
  }

  bool PublicKey::parse(const char *pemKey)
  {
    return parse((const uint8_t *)pemKey, strlen_P(pemKey));
  }

  bool PublicKey::parse(const uint8_t *derKey, size_t derLen)
  {
    if (_key)
    {
      esp8266_br_ssl::free_public_key(_key);
      _key = nullptr;
    }
    _key = esp8266_br_ssl::read_public_key((const char *)derKey, derLen);
    return _key ? true : false;
  }

  bool PublicKey::isRSA() const
  {
    if (!_key || _key->key_type != BR_KEYTYPE_RSA)
    {
      return false;
    }
    return true;
  }

  bool PublicKey::isEC() const
  {
    if (!_key || _key->key_type != BR_KEYTYPE_EC)
    {
      return false;
    }
    return true;
  }

  const br_rsa_public_key *PublicKey::getRSA() const
  {
    if (!_key || _key->key_type != BR_KEYTYPE_RSA)
    {
      return nullptr;
    }
    return &_key->key.rsa;
  }

  const br_ec_public_key *PublicKey::getEC() const
  {
    if (!_key || _key->key_type != BR_KEYTYPE_EC)
    {
      return nullptr;
    }
    return &_key->key.ec;
  }

  // ----- Private Key -----

  PrivateKey::PrivateKey()
  {
    _key = nullptr;
  }

  PrivateKey::PrivateKey(const char *pemKey)
  {
    _key = nullptr;
    parse(pemKey);
  }

  PrivateKey::PrivateKey(const uint8_t *derKey, size_t derLen)
  {
    _key = nullptr;
    parse(derKey, derLen);
  }

  PrivateKey::~PrivateKey()
  {
    if (_key)
    {
      esp8266_br_ssl::free_private_key(_key);
    }
  }

  bool PrivateKey::parse(const char *pemKey)
  {
    return parse((const uint8_t *)pemKey, strlen_P(pemKey));
  }

  bool PrivateKey::parse(const uint8_t *derKey, size_t derLen)
  {
    if (_key)
    {
      esp8266_br_ssl::free_private_key(_key);
      _key = nullptr;
    }
    _key = esp8266_br_ssl::read_private_key((const char *)derKey, derLen);
    return _key ? true : false;
  }

  bool PrivateKey::isRSA() const
  {
    if (!_key || _key->key_type != BR_KEYTYPE_RSA)
    {
      return false;
    }
    return true;
  }

  bool PrivateKey::isEC() const
  {
    if (!_key || _key->key_type != BR_KEYTYPE_EC)
    {
      return false;
    }
    return true;
  }

  const br_rsa_private_key *PrivateKey::getRSA() const
  {
    if (!_key || _key->key_type != BR_KEYTYPE_RSA)
    {
      return nullptr;
    }
    return &_key->key.rsa;
  }

  const br_ec_private_key *PrivateKey::getEC() const
  {
    if (!_key || _key->key_type != BR_KEYTYPE_EC)
    {
      return nullptr;
    }
    return &_key->key.ec;
  }

  // ----- Certificate Lists -----

  ESP8266_X509_List::ESP8266_X509_List()
  {
    _count = 0;
    _cert = nullptr;
    _ta = nullptr;
  }

  ESP8266_X509_List::ESP8266_X509_List(const char *pemCert)
  {
    _count = 0;
    _cert = nullptr;
    _ta = nullptr;
    append(pemCert);
  }

  ESP8266_X509_List::ESP8266_X509_List(const uint8_t *derCert, size_t derLen)
  {
    _count = 0;
    _cert = nullptr;
    _ta = nullptr;
    append(derCert, derLen);
  }

  ESP8266_X509_List::~ESP8266_X509_List()
  {
    esp8266_br_ssl::free_certificates(_cert, _count); // also frees cert
    for (size_t i = 0; i < _count; i++)
    {
      esp8266_br_ssl::free_ta_contents(&_ta[i]);
    }
    free(_ta);
  }

  bool ESP8266_X509_List::append(const char *pemCert)
  {
    return append((const uint8_t *)pemCert, strlen_P(pemCert));
  }

  bool ESP8266_X509_List::append(const uint8_t *derCert, size_t derLen)
  {
    size_t numCerts;
    br_x509_certificate *newCerts = esp8266_br_ssl::read_certificates((const char *)derCert, derLen, &numCerts);
    if (!newCerts)
    {
      return false;
    }

    // Add in the certificates
    br_x509_certificate *saveCert = _cert;
    _cert = (br_x509_certificate *)realloc(_cert, (numCerts + _count) * sizeof(br_x509_certificate));
    if (!_cert)
    {
      free(newCerts);
      _cert = saveCert;
      return false;
    }
    memcpy(&_cert[_count], newCerts, numCerts * sizeof(br_x509_certificate));
    free(newCerts);

    // Build TAs for each certificate
    br_x509_trust_anchor *saveTa = _ta;
    _ta = (br_x509_trust_anchor *)realloc(_ta, (numCerts + _count) * sizeof(br_x509_trust_anchor));
    if (!_ta)
    {
      _ta = saveTa;
      return false;
    }
    for (size_t i = 0; i < numCerts; i++)
    {
      br_x509_trust_anchor *newTa = esp8266_br_ssl::certificate_to_trust_anchor(&_cert[_count + i]);
      if (newTa)
      {
        _ta[_count + i] = *newTa;
        free(newTa);
      }
      else
      {
        return false; // OOM
      }
    }
    _count += numCerts;

    return true;
  }

  // SHA256 hash for updater
  void HashSHA256::begin()
  {
    br_sha256_init(&_cc);
    memset(_sha256, 0, sizeof(_sha256));
  }

  void HashSHA256::add(const void *data, uint32_t len)
  {
    br_sha256_update(&_cc, data, len);
  }

  void HashSHA256::end()
  {
    br_sha256_out(&_cc, _sha256);
  }

  int HashSHA256::len()
  {
    return sizeof(_sha256);
  }

  const void *HashSHA256::hash()
  {
    return (const void *)_sha256;
  }

  const unsigned char *HashSHA256::oid()
  {
    return BR_HASH_OID_SHA256;
  }

  // SHA256 verifier
  uint32_t SigningVerifier::length()
  {
    if (!_pubKey)
    {
      return 0;
    }
    else if (_pubKey->isRSA())
    {
      return _pubKey->getRSA()->nlen;
    }
    else if (_pubKey->isEC())
    {
      return _pubKey->getEC()->qlen;
    }
    else
    {
      return 0;
    }
  }
  /*
  
// We need to use the 2nd stack to do a verification, so do the thunk
// directly inside the class function for ease of use.
extern "C" bool SigningVerifier_verify(PublicKey *_pubKey, UpdaterHashClass *hash, const void *signature, uint32_t signatureLen) {
  if (_pubKey->isRSA()) {
    bool ret;
    unsigned char vrf[hash->len()];
    br_rsa_pkcs1_vrfy vrfy = br_rsa_pkcs1_vrfy_get_default();
    ret = vrfy((const unsigned char *)signature, signatureLen, hash->oid(), sizeof(vrf), _pubKey->getRSA(), vrf);
    if (!ret || memcmp(vrf, hash->hash(), sizeof(vrf)) ) {
      return false;
    } else {
      return true;
    }
  } else {
    br_ecdsa_vrfy vrfy = br_ecdsa_vrfy_raw_get_default();
    // The EC verifier actually does the compare, unlike the RSA one
    return vrfy(br_ec_get_default(), hash->hash(), hash->len(), _pubKey->getEC(), (const unsigned char *)signature, signatureLen);
  }
};



#if !CORE_MOCK
make_stack_thunk(SigningVerifier_verify);
extern "C" bool thunk_SigningVerifier_verify(PublicKey *_pubKey, UpdaterHashClass *hash, const void *signature, uint32_t signatureLen);
#endif

bool SigningVerifier::verify(UpdaterHashClass *hash, const void *signature, uint32_t signatureLen) {
  if (!_pubKey || !hash || !signature || signatureLen != length()) return false;
#if !CORE_MOCK
    return thunk_SigningVerifier_verify(_pubKey, hash, signature, signatureLen);
#else
    return SigningVerifier_verify(_pubKey, hash, signature, signatureLen);
#endif
}



#if !CORE_MOCK

// Second stack thunked helpers
make_stack_thunk(br_ssl_engine_recvapp_ack);
make_stack_thunk(br_ssl_engine_recvapp_buf);
make_stack_thunk(br_ssl_engine_recvrec_ack);
make_stack_thunk(br_ssl_engine_recvrec_buf);
make_stack_thunk(br_ssl_engine_sendapp_ack);
make_stack_thunk(br_ssl_engine_sendapp_buf);
make_stack_thunk(br_ssl_engine_sendrec_ack);
make_stack_thunk(br_ssl_engine_sendrec_buf);

#endif
*/

}; // namespace ESP8266_TCP

#if ARDUINO_SIGNING
namespace
{
  static ESP8266_TCP::PublicKey signingPubKey(signing_pubkey);
  static ESP8266_TCP::HashSHA256 __signingHash;
  static ESP8266_TCP::SigningVerifier __signingVerifier(&signingPubKey);
}; // namespace

namespace esp8266
{
  UpdaterHashClass &updaterSigningHash = __signingHash;
  UpdaterVerifyClass &updaterSigningVerifier = __signingVerifier;
}; // namespace esp8266
#endif

#endif /* ESP8266 */

#endif /* ESP8266_BearSSLHelpers_CPP */